GopalSaraf/Practicals/PSDL/include/proc/pic16lf1765.inc
// Register: PWM3DCL
#define PWM3DCL PWM3DCL
PWM3DCL                                  equ 0617h
// bitfield definitions
PWM3DCL_DC_POSN                          equ 0006h
PWM3DCL_DC_POSITION                      equ 0006h
PWM3DCL_DC_SIZE                          equ 0002h
PWM3DCL_DC_LENGTH                        equ 0002h
PWM3DCL_DC_MASK                          equ 00C0h
PWM3DCL_DC0_POSN                         equ 0006h
PWM3DCL_DC0_POSITION                     equ 0006h
PWM3DCL_DC0_SIZE                         equ 0001h
PWM3DCL_DC0_LENGTH                       equ 0001h
PWM3DCL_DC0_MASK                         equ 0040h
PWM3DCL_DC1_POSN                         equ 0007h
PWM3DCL_DC1_POSITION                     equ 0007h
PWM3DCL_DC1_SIZE                         equ 0001h
PWM3DCL_DC1_LENGTH                       equ 0001h
PWM3DCL_DC1_MASK                         equ 0080h
PWM3DCL_PWM3DC0_POSN                     equ 0006h
PWM3DCL_PWM3DC0_POSITION                 equ 0006h
PWM3DCL_PWM3DC0_SIZE                     equ 0001h
PWM3DCL_PWM3DC0_LENGTH                   equ 0001h
PWM3DCL_PWM3DC0_MASK                     equ 0040h
PWM3DCL_PWM3DC1_POSN                     equ 0007h
PWM3DCL_PWM3DC1_POSITION                 equ 0007h
PWM3DCL_PWM3DC1_SIZE                     equ 0001h
PWM3DCL_PWM3DC1_LENGTH                   equ 0001h
PWM3DCL_PWM3DC1_MASK                     equ 0080h
PWM3DCL_PWMPW0_POSN                      equ 0006h
PWM3DCL_PWMPW0_POSITION                  equ 0006h
PWM3DCL_PWMPW0_SIZE                      equ 0001h
PWM3DCL_PWMPW0_LENGTH                    equ 0001h
PWM3DCL_PWMPW0_MASK                      equ 0040h
PWM3DCL_PWMPW1_POSN                      equ 0007h
PWM3DCL_PWMPW1_POSITION                  equ 0007h
PWM3DCL_PWMPW1_SIZE                      equ 0001h
PWM3DCL_PWMPW1_LENGTH                    equ 0001h
PWM3DCL_PWMPW1_MASK                      equ 0080h

// Register: PWM3DCH
#define PWM3DCH PWM3DCH
PWM3DCH                                  equ 0618h
// bitfield definitions
PWM3DCH_DC_POSN                          equ 0000h
PWM3DCH_DC_POSITION                      equ 0000h
PWM3DCH_DC_SIZE                          equ 0008h
PWM3DCH_DC_LENGTH                        equ 0008h
PWM3DCH_DC_MASK                          equ 00FFh
PWM3DCH_DC2_POSN                         equ 0000h
PWM3DCH_DC2_POSITION                     equ 0000h
PWM3DCH_DC2_SIZE                         equ 0001h
PWM3DCH_DC2_LENGTH                       equ 0001h
PWM3DCH_DC2_MASK                         equ 0001h
PWM3DCH_DC3_POSN                         equ 0001h
PWM3DCH_DC3_POSITION                     equ 0001h
PWM3DCH_DC3_SIZE                         equ 0001h
PWM3DCH_DC3_LENGTH                       equ 0001h
PWM3DCH_DC3_MASK                         equ 0002h
PWM3DCH_DC4_POSN                         equ 0002h
PWM3DCH_DC4_POSITION                     equ 0002h
PWM3DCH_DC4_SIZE                         equ 0001h
PWM3DCH_DC4_LENGTH                       equ 0001h
PWM3DCH_DC4_MASK                         equ 0004h
PWM3DCH_DC5_POSN                         equ 0003h
PWM3DCH_DC5_POSITION                     equ 0003h
PWM3DCH_DC5_SIZE                         equ 0001h
PWM3DCH_DC5_LENGTH                       equ 0001h
PWM3DCH_DC5_MASK                         equ 0008h
PWM3DCH_DC6_POSN                         equ 0004h
PWM3DCH_DC6_POSITION                     equ 0004h
PWM3DCH_DC6_SIZE                         equ 0001h
PWM3DCH_DC6_LENGTH                       equ 0001h
PWM3DCH_DC6_MASK                         equ 0010h
PWM3DCH_DC7_POSN                         equ 0005h
PWM3DCH_DC7_POSITION                     equ 0005h
PWM3DCH_DC7_SIZE                         equ 0001h
PWM3DCH_DC7_LENGTH                       equ 0001h
PWM3DCH_DC7_MASK                         equ 0020h
PWM3DCH_DC8_POSN                         equ 0006h
PWM3DCH_DC8_POSITION                     equ 0006h
PWM3DCH_DC8_SIZE                         equ 0001h
PWM3DCH_DC8_LENGTH                       equ 0001h
PWM3DCH_DC8_MASK                         equ 0040h
PWM3DCH_DC9_POSN                         equ 0007h
PWM3DCH_DC9_POSITION                     equ 0007h
PWM3DCH_DC9_SIZE                         equ 0001h
PWM3DCH_DC9_LENGTH                       equ 0001h
PWM3DCH_DC9_MASK                         equ 0080h
PWM3DCH_PWM3DC2_POSN                     equ 0000h
PWM3DCH_PWM3DC2_POSITION                 equ 0000h
PWM3DCH_PWM3DC2_SIZE                     equ 0001h
PWM3DCH_PWM3DC2_LENGTH                   equ 0001h
PWM3DCH_PWM3DC2_MASK                     equ 0001h
PWM3DCH_PWM3DC3_POSN                     equ 0001h
PWM3DCH_PWM3DC3_POSITION                 equ 0001h
PWM3DCH_PWM3DC3_SIZE                     equ 0001h
PWM3DCH_PWM3DC3_LENGTH                   equ 0001h
PWM3DCH_PWM3DC3_MASK                     equ 0002h
PWM3DCH_PWM3DC4_POSN                     equ 0002h
PWM3DCH_PWM3DC4_POSITION                 equ 0002h
PWM3DCH_PWM3DC4_SIZE                     equ 0001h
PWM3DCH_PWM3DC4_LENGTH                   equ 0001h
PWM3DCH_PWM3DC4_MASK                     equ 0004h
PWM3DCH_PWM3DC5_POSN                     equ 0003h
PWM3DCH_PWM3DC5_POSITION                 equ 0003h
PWM3DCH_PWM3DC5_SIZE                     equ 0001h
PWM3DCH_PWM3DC5_LENGTH                   equ 0001h
PWM3DCH_PWM3DC5_MASK                     equ 0008h
PWM3DCH_PWM3DC6_POSN                     equ 0004h
PWM3DCH_PWM3DC6_POSITION                 equ 0004h
PWM3DCH_PWM3DC6_SIZE                     equ 0001h
PWM3DCH_PWM3DC6_LENGTH                   equ 0001h
PWM3DCH_PWM3DC6_MASK                     equ 0010h
PWM3DCH_PWM3DC7_POSN                     equ 0005h
PWM3DCH_PWM3DC7_POSITION                 equ 0005h
PWM3DCH_PWM3DC7_SIZE                     equ 0001h
PWM3DCH_PWM3DC7_LENGTH                   equ 0001h
PWM3DCH_PWM3DC7_MASK                     equ 0020h
PWM3DCH_PWM3DC8_POSN                     equ 0006h
PWM3DCH_PWM3DC8_POSITION                 equ 0006h
PWM3DCH_PWM3DC8_SIZE                     equ 0001h
PWM3DCH_PWM3DC8_LENGTH                   equ 0001h
PWM3DCH_PWM3DC8_MASK                     equ 0040h
PWM3DCH_PWM3DC9_POSN                     equ 0007h
PWM3DCH_PWM3DC9_POSITION                 equ 0007h
PWM3DCH_PWM3DC9_SIZE                     equ 0001h
PWM3DCH_PWM3DC9_LENGTH                   equ 0001h
PWM3DCH_PWM3DC9_MASK                     equ 0080h
PWM3DCH_PWMPW2_POSN                      equ 0000h
PWM3DCH_PWMPW2_POSITION                  equ 0000h
PWM3DCH_PWMPW2_SIZE                      equ 0001h
PWM3DCH_PWMPW2_LENGTH                    equ 0001h
PWM3DCH_PWMPW2_MASK                      equ 0001h
PWM3DCH_PWMPW3_POSN                      equ 0001h
PWM3DCH_PWMPW3_POSITION                  equ 0001h
PWM3DCH_PWMPW3_SIZE                      equ 0001h
PWM3DCH_PWMPW3_LENGTH                    equ 0001h
PWM3DCH_PWMPW3_MASK                      equ 0002h
PWM3DCH_PWMPW4_POSN                      equ 0002h
PWM3DCH_PWMPW4_POSITION                  equ 0002h
PWM3DCH_PWMPW4_SIZE                      equ 0001h
PWM3DCH_PWMPW4_LENGTH                    equ 0001h
PWM3DCH_PWMPW4_MASK                      equ 0004h
PWM3DCH_PWMPW5_POSN                      equ 0003h
PWM3DCH_PWMPW5_POSITION                  equ 0003h
PWM3DCH_PWMPW5_SIZE                      equ 0001h
PWM3DCH_PWMPW5_LENGTH                    equ 0001h
PWM3DCH_PWMPW5_MASK                      equ 0008h
PWM3DCH_PWMPW6_POSN                      equ 0004h
PWM3DCH_PWMPW6_POSITION                  equ 0004h
PWM3DCH_PWMPW6_SIZE                      equ 0001h
PWM3DCH_PWMPW6_LENGTH                    equ 0001h
PWM3DCH_PWMPW6_MASK                      equ 0010h
PWM3DCH_PWMPW7_POSN                      equ 0005h
PWM3DCH_PWMPW7_POSITION                  equ 0005h
PWM3DCH_PWMPW7_SIZE                      equ 0001h
PWM3DCH_PWMPW7_LENGTH                    equ 0001h
PWM3DCH_PWMPW7_MASK                      equ 0020h
PWM3DCH_PWMPW8_POSN                      equ 0006h
PWM3DCH_PWMPW8_POSITION                  equ 0006h
PWM3DCH_PWMPW8_SIZE                      equ 0001h
PWM3DCH_PWMPW8_LENGTH                    equ 0001h
PWM3DCH_PWMPW8_MASK                      equ 0040h
PWM3DCH_PWMPW9_POSN                      equ 0007h
PWM3DCH_PWMPW9_POSITION                  equ 0007h
PWM3DCH_PWMPW9_SIZE                      equ 0001h
PWM3DCH_PWMPW9_LENGTH                    equ 0001h
PWM3DCH_PWMPW9_MASK                      equ 0080h

// Register: PWM3CON
#define PWM3CON PWM3CON
PWM3CON                                  equ 0619h
// bitfield definitions
PWM3CON_POL_POSN                         equ 0004h
PWM3CON_POL_POSITION                     equ 0004h
PWM3CON_POL_SIZE                         equ 0001h
PWM3CON_POL_LENGTH                       equ 0001h
PWM3CON_POL_MASK                         equ 0010h
PWM3CON_OUT_POSN                         equ 0005h
PWM3CON_OUT_POSITION                     equ 0005h
PWM3CON_OUT_SIZE                         equ 0001h
PWM3CON_OUT_LENGTH                       equ 0001h
PWM3CON_OUT_MASK                         equ 0020h
PWM3CON_EN_POSN                          equ 0007h
PWM3CON_EN_POSITION                      equ 0007h
PWM3CON_EN_SIZE                          equ 0001h
PWM3CON_EN_LENGTH                        equ 0001h
PWM3CON_EN_MASK                          equ 0080h
PWM3CON_PWM3POL_POSN                     equ 0004h
PWM3CON_PWM3POL_POSITION                 equ 0004h
PWM3CON_PWM3POL_SIZE                     equ 0001h
PWM3CON_PWM3POL_LENGTH                   equ 0001h
PWM3CON_PWM3POL_MASK                     equ 0010h
PWM3CON_PWM3OUT_POSN                     equ 0005h
PWM3CON_PWM3OUT_POSITION                 equ 0005h
PWM3CON_PWM3OUT_SIZE                     equ 0001h
PWM3CON_PWM3OUT_LENGTH                   equ 0001h
PWM3CON_PWM3OUT_MASK                     equ 0020h
PWM3CON_PWM3EN_POSN                      equ 0007h
PWM3CON_PWM3EN_POSITION                  equ 0007h
PWM3CON_PWM3EN_SIZE                      equ 0001h
PWM3CON_PWM3EN_LENGTH                    equ 0001h
PWM3CON_PWM3EN_MASK                      equ 0080h

// Register: COG1PHR
#define COG1PHR COG1PHR
COG1PHR                                  equ 068Dh
// bitfield definitions
COG1PHR_PHR_POSN                         equ 0000h
COG1PHR_PHR_POSITION                     equ 0000h
COG1PHR_PHR_SIZE                         equ 0006h
COG1PHR_PHR_LENGTH                       equ 0006h
COG1PHR_PHR_MASK                         equ 003Fh
COG1PHR_PHR0_POSN                        equ 0000h
COG1PHR_PHR0_POSITION                    equ 0000h
COG1PHR_PHR0_SIZE                        equ 0001h
COG1PHR_PHR0_LENGTH                      equ 0001h
COG1PHR_PHR0_MASK                        equ 0001h
COG1PHR_PHR1_POSN                        equ 0001h
COG1PHR_PHR1_POSITION                    equ 0001h
COG1PHR_PHR1_SIZE                        equ 0001h
COG1PHR_PHR1_LENGTH                      equ 0001h
COG1PHR_PHR1_MASK                        equ 0002h
COG1PHR_PHR2_POSN                        equ 0002h
COG1PHR_PHR2_POSITION                    equ 0002h
COG1PHR_PHR2_SIZE                        equ 0001h
COG1PHR_PHR2_LENGTH                      equ 0001h
COG1PHR_PHR2_MASK                        equ 0004h
COG1PHR_PHR3_POSN                        equ 0003h
COG1PHR_PHR3_POSITION                    equ 0003h
COG1PHR_PHR3_SIZE                        equ 0001h
COG1PHR_PHR3_LENGTH                      equ 0001h
COG1PHR_PHR3_MASK                        equ 0008h
COG1PHR_PHR4_POSN                        equ 0004h
COG1PHR_PHR4_POSITION                    equ 0004h
COG1PHR_PHR4_SIZE                        equ 0001h
COG1PHR_PHR4_LENGTH                      equ 0001h
COG1PHR_PHR4_MASK                        equ 0010h
COG1PHR_PHR5_POSN                        equ 0005h
COG1PHR_PHR5_POSITION                    equ 0005h
COG1PHR_PHR5_SIZE                        equ 0001h
COG1PHR_PHR5_LENGTH                      equ 0001h
COG1PHR_PHR5_MASK                        equ 0020h
COG1PHR_G1PHR0_POSN                      equ 0000h
COG1PHR_G1PHR0_POSITION                  equ 0000h
COG1PHR_G1PHR0_SIZE                      equ 0001h
COG1PHR_G1PHR0_LENGTH                    equ 0001h
COG1PHR_G1PHR0_MASK                      equ 0001h
COG1PHR_G1PHR1_POSN                      equ 0001h
COG1PHR_G1PHR1_POSITION                  equ 0001h
COG1PHR_G1PHR1_SIZE                      equ 0001h
COG1PHR_G1PHR1_LENGTH                    equ 0001h
COG1PHR_G1PHR1_MASK                      equ 0002h
COG1PHR_G1PHR2_POSN                      equ 0002h
COG1PHR_G1PHR2_POSITION                  equ 0002h
COG1PHR_G1PHR2_SIZE                      equ 0001h
COG1PHR_G1PHR2_LENGTH                    equ 0001h
COG1PHR_G1PHR2_MASK                      equ 0004h
COG1PHR_G1PHR3_POSN                      equ 0003h
COG1PHR_G1PHR3_POSITION                  equ 0003h
COG1PHR_G1PHR3_SIZE                      equ 0001h
COG1PHR_G1PHR3_LENGTH                    equ 0001h
COG1PHR_G1PHR3_MASK                      equ 0008h
COG1PHR_G1PHR4_POSN                      equ 0004h
COG1PHR_G1PHR4_POSITION                  equ 0004h
COG1PHR_G1PHR4_SIZE                      equ 0001h
COG1PHR_G1PHR4_LENGTH                    equ 0001h
COG1PHR_G1PHR4_MASK                      equ 0010h
COG1PHR_G1PHR5_POSN                      equ 0005h
COG1PHR_G1PHR5_POSITION                  equ 0005h
COG1PHR_G1PHR5_SIZE                      equ 0001h
COG1PHR_G1PHR5_LENGTH                    equ 0001h
COG1PHR_G1PHR5_MASK                      equ 0020h

// Register: COG1PHF
#define COG1PHF COG1PHF
COG1PHF                                  equ 068Eh
// bitfield definitions
COG1PHF_PHF_POSN                         equ 0000h
COG1PHF_PHF_POSITION                     equ 0000h
COG1PHF_PHF_SIZE                         equ 0006h
COG1PHF_PHF_LENGTH                       equ 0006h
COG1PHF_PHF_MASK                         equ 003Fh
COG1PHF_PHF0_POSN                        equ 0000h
COG1PHF_PHF0_POSITION                    equ 0000h
COG1PHF_PHF0_SIZE                        equ 0001h
COG1PHF_PHF0_LENGTH                      equ 0001h
COG1PHF_PHF0_MASK                        equ 0001h
COG1PHF_PHF1_POSN                        equ 0001h
COG1PHF_PHF1_POSITION                    equ 0001h
COG1PHF_PHF1_SIZE                        equ 0001h
COG1PHF_PHF1_LENGTH                      equ 0001h
COG1PHF_PHF1_MASK                        equ 0002h
COG1PHF_PHF2_POSN                        equ 0002h
COG1PHF_PHF2_POSITION                    equ 0002h
COG1PHF_PHF2_SIZE                        equ 0001h
COG1PHF_PHF2_LENGTH                      equ 0001h
COG1PHF_PHF2_MASK                        equ 0004h
COG1PHF_PHF3_POSN                        equ 0003h
COG1PHF_PHF3_POSITION                    equ 0003h
COG1PHF_PHF3_SIZE                        equ 0001h
COG1PHF_PHF3_LENGTH                      equ 0001h
COG1PHF_PHF3_MASK                        equ 0008h
COG1PHF_PHF4_POSN                        equ 0004h
COG1PHF_PHF4_POSITION                    equ 0004h
COG1PHF_PHF4_SIZE                        equ 0001h
COG1PHF_PHF4_LENGTH                      equ 0001h
COG1PHF_PHF4_MASK                        equ 0010h
COG1PHF_PHF5_POSN                        equ 0005h
COG1PHF_PHF5_POSITION                    equ 0005h
COG1PHF_PHF5_SIZE                        equ 0001h
COG1PHF_PHF5_LENGTH                      equ 0001h
COG1PHF_PHF5_MASK                        equ 0020h
COG1PHF_G1PHF0_POSN                      equ 0000h
COG1PHF_G1PHF0_POSITION                  equ 0000h
COG1PHF_G1PHF0_SIZE                      equ 0001h
COG1PHF_G1PHF0_LENGTH                    equ 0001h
COG1PHF_G1PHF0_MASK                      equ 0001h
COG1PHF_G1PHF1_POSN                      equ 0001h
COG1PHF_G1PHF1_POSITION                  equ 0001h
COG1PHF_G1PHF1_SIZE                      equ 0001h
COG1PHF_G1PHF1_LENGTH                    equ 0001h
COG1PHF_G1PHF1_MASK                      equ 0002h
COG1PHF_G1PHF2_POSN                      equ 0002h
COG1PHF_G1PHF2_POSITION                  equ 0002h
COG1PHF_G1PHF2_SIZE                      equ 0001h
COG1PHF_G1PHF2_LENGTH                    equ 0001h
COG1PHF_G1PHF2_MASK                      equ 0004h
COG1PHF_G1PHF3_POSN                      equ 0003h
COG1PHF_G1PHF3_POSITION                  equ 0003h
COG1PHF_G1PHF3_SIZE                      equ 0001h
COG1PHF_G1PHF3_LENGTH                    equ 0001h
COG1PHF_G1PHF3_MASK                      equ 0008h
COG1PHF_G1PHF4_POSN                      equ 0004h
COG1PHF_G1PHF4_POSITION                  equ 0004h
COG1PHF_G1PHF4_SIZE                      equ 0001h
COG1PHF_G1PHF4_LENGTH                    equ 0001h
COG1PHF_G1PHF4_MASK                      equ 0010h
COG1PHF_G1PHF5_POSN                      equ 0005h
COG1PHF_G1PHF5_POSITION                  equ 0005h
COG1PHF_G1PHF5_SIZE                      equ 0001h
COG1PHF_G1PHF5_LENGTH                    equ 0001h
COG1PHF_G1PHF5_MASK                      equ 0020h

