GopalSaraf/Practicals/PSDL/include/proc/pic16lf1765.inc
#define MSK2                             BANKMASK(SSP1MSK), 2
#define MSK3                             BANKMASK(SSP1MSK), 3
#define MSK4                             BANKMASK(SSP1MSK), 4
#define MSK5                             BANKMASK(SSP1MSK), 5
#define MSK6                             BANKMASK(SSP1MSK), 6
#define MSK7                             BANKMASK(SSP1MSK), 7
#define NSS                              BANKMASK(DAC3CON0), 0
#define NSS0                             BANKMASK(DAC1CON0), 0
#define ODA0                             BANKMASK(ODCONA), 0
#define ODA1                             BANKMASK(ODCONA), 1
#define ODA2                             BANKMASK(ODCONA), 2
#define ODA4                             BANKMASK(ODCONA), 4
#define ODA5                             BANKMASK(ODCONA), 5
#define ODC0                             BANKMASK(ODCONC), 0
#define ODC1                             BANKMASK(ODCONC), 1
#define ODC2                             BANKMASK(ODCONC), 2
#define ODC3                             BANKMASK(ODCONC), 3
#define ODC4                             BANKMASK(ODCONC), 4
#define ODC5                             BANKMASK(ODCONC), 5
#define OE                               BANKMASK(DAC1CON0), 5
#define OERR                             BANKMASK(RC1STA), 1
#define OFIE                             BANKMASK(PWM5INTE), 3
#define OFIF                             BANKMASK(PWM5INTF), 3
#define OFO                              BANKMASK(PWM5OFCON), 4
#define OPA1EN                           BANKMASK(OPA1CON), 7
#define OPA1ORM0                         BANKMASK(OPA1CON), 0
#define OPA1ORM1                         BANKMASK(OPA1CON), 1
#define OPA1ORPOL                        BANKMASK(OPA1CON), 2
#define OPA1UG                           BANKMASK(OPA1CON), 4
#define OPOL                             BANKMASK(MD1CON0), 4
#define ORM0                             BANKMASK(OPA1CON), 0
#define ORM1                             BANKMASK(OPA1CON), 1
#define ORPOL                            BANKMASK(OPA1CON), 2
#define OS                               BANKMASK(PRG1CON0), 1
#define OSCEN                            BANKMASK(T1CON), 3
#define OSFIE                            BANKMASK(PIE2), 7
#define OSFIF                            BANKMASK(PIR2), 7
#define OSTS                             BANKMASK(OSCSTAT), 5
#define P3TSEL0                          BANKMASK(CCPTMRS), 4
#define P3TSEL1                          BANKMASK(CCPTMRS), 5
#define PCIE                             BANKMASK(SSP1CON3), 6
#define PEIE                             BANKMASK(INTCON), 6
#define PEN                              BANKMASK(SSP1CON2), 2
#define PHF0                             BANKMASK(COG1PHF), 0
#define PHF1                             BANKMASK(COG1PHF), 1
#define PHF2                             BANKMASK(COG1PHF), 2
#define PHF3                             BANKMASK(COG1PHF), 3
#define PHF4                             BANKMASK(COG1PHF), 4
#define PHF5                             BANKMASK(COG1PHF), 5
#define PHIE                             BANKMASK(PWM5INTE), 2
#define PHIF                             BANKMASK(PWM5INTF), 2
#define PHR0                             BANKMASK(COG1PHR), 0
#define PHR1                             BANKMASK(COG1PHR), 1
#define PHR2                             BANKMASK(COG1PHR), 2
#define PHR3                             BANKMASK(COG1PHR), 3
#define PHR4                             BANKMASK(COG1PHR), 4
#define PHR5                             BANKMASK(COG1PHR), 5
#define PLLR                             BANKMASK(OSCSTAT), 6
#define POLA                             BANKMASK(COG1CON1), 0
#define POLB                             BANKMASK(COG1CON1), 1
#define POLC                             BANKMASK(COG1CON1), 2
#define POLD                             BANKMASK(COG1CON1), 3
#define PPSLOCKED                        BANKMASK(PPSLOCK), 0
#define PRIE                             BANKMASK(PWM5INTE), 0
#define PRIF                             BANKMASK(PWM5INTF), 0
#define PSA                              BANKMASK(OPTION_REG), 3
#define PWM3DC0                          BANKMASK(PWM3DCL), 6
#define PWM3DC1                          BANKMASK(PWM3DCL), 7
#define PWM3DC2                          BANKMASK(PWM3DCH), 0
#define PWM3DC3                          BANKMASK(PWM3DCH), 1
#define PWM3DC4                          BANKMASK(PWM3DCH), 2
#define PWM3DC5                          BANKMASK(PWM3DCH), 3
#define PWM3DC6                          BANKMASK(PWM3DCH), 4
#define PWM3DC7                          BANKMASK(PWM3DCH), 5
#define PWM3DC8                          BANKMASK(PWM3DCH), 6
#define PWM3DC9                          BANKMASK(PWM3DCH), 7
#define PWM3EN                           BANKMASK(PWM3CON), 7
#define PWM3OUT                          BANKMASK(PWM3CON), 5
#define PWM3POL                          BANKMASK(PWM3CON), 4
#define PWM5CS0                          BANKMASK(PWM5CLKCON), 0
#define PWM5CS1                          BANKMASK(PWM5CLKCON), 1
#define PWM5CS2                          BANKMASK(PWM5CLKCON), 2
#define PWM5DCH0                         BANKMASK(PWM5DCH), 0
#define PWM5DCH1                         BANKMASK(PWM5DCH), 1
#define PWM5DCH2                         BANKMASK(PWM5DCH), 2
#define PWM5DCH3                         BANKMASK(PWM5DCH), 3
#define PWM5DCH4                         BANKMASK(PWM5DCH), 4
#define PWM5DCH5                         BANKMASK(PWM5DCH), 5
#define PWM5DCH6                         BANKMASK(PWM5DCH), 6
#define PWM5DCH7                         BANKMASK(PWM5DCH), 7
#define PWM5DCIE                         BANKMASK(PWM5INTE), 1
#define PWM5DCIF                         BANKMASK(PWM5INTF), 1
#define PWM5DCL0                         BANKMASK(PWM5DCL), 0
#define PWM5DCL1                         BANKMASK(PWM5DCL), 1
#define PWM5DCL2                         BANKMASK(PWM5DCL), 2
#define PWM5DCL3                         BANKMASK(PWM5DCL), 3
#define PWM5DCL4                         BANKMASK(PWM5DCL), 4
#define PWM5DCL5                         BANKMASK(PWM5DCL), 5
#define PWM5DCL6                         BANKMASK(PWM5DCL), 6
#define PWM5DCL7                         BANKMASK(PWM5DCL), 7
#define PWM5EN                           BANKMASK(PWM5CON), 7
#define PWM5IE                           BANKMASK(PIE3), 6
#define PWM5IF                           BANKMASK(PIR3), 6
#define PWM5LD                           BANKMASK(PWM5LDCON), 7
#define PWM5MODE0                        BANKMASK(PWM5CON), 2
#define PWM5MODE1                        BANKMASK(PWM5CON), 3
#define PWM5OFH0                         BANKMASK(PWM5OFH), 0
#define PWM5OFH1                         BANKMASK(PWM5OFH), 1
#define PWM5OFH2                         BANKMASK(PWM5OFH), 2
#define PWM5OFH3                         BANKMASK(PWM5OFH), 3
#define PWM5OFH4                         BANKMASK(PWM5OFH), 4
#define PWM5OFH5                         BANKMASK(PWM5OFH), 5
#define PWM5OFH6                         BANKMASK(PWM5OFH), 6
#define PWM5OFH7                         BANKMASK(PWM5OFH), 7
#define PWM5OFIE                         BANKMASK(PWM5INTE), 3
#define PWM5OFIF                         BANKMASK(PWM5INTF), 3
#define PWM5OFL0                         BANKMASK(PWM5OFL), 0
#define PWM5OFL1                         BANKMASK(PWM5OFL), 1
#define PWM5OFL2                         BANKMASK(PWM5OFL), 2
#define PWM5OFL3                         BANKMASK(PWM5OFL), 3
#define PWM5OFL4                         BANKMASK(PWM5OFL), 4
#define PWM5OFL5                         BANKMASK(PWM5OFL), 5
#define PWM5OFL6                         BANKMASK(PWM5OFL), 6
#define PWM5OFL7                         BANKMASK(PWM5OFL), 7
#define PWM5OFMC                         BANKMASK(PWM5OFCON), 4
#define PWM5OUT                          BANKMASK(PWM5CON), 5
#define PWM5PHH0                         BANKMASK(PWM5PHH), 0
#define PWM5PHH1                         BANKMASK(PWM5PHH), 1
#define PWM5PHH2                         BANKMASK(PWM5PHH), 2
#define PWM5PHH3                         BANKMASK(PWM5PHH), 3
#define PWM5PHH4                         BANKMASK(PWM5PHH), 4
#define PWM5PHH5                         BANKMASK(PWM5PHH), 5
#define PWM5PHH6                         BANKMASK(PWM5PHH), 6
#define PWM5PHH7                         BANKMASK(PWM5PHH), 7
#define PWM5PHIE                         BANKMASK(PWM5INTE), 2
#define PWM5PHIF                         BANKMASK(PWM5INTF), 2
#define PWM5PHL0                         BANKMASK(PWM5PHL), 0
#define PWM5PHL1                         BANKMASK(PWM5PHL), 1
#define PWM5PHL2                         BANKMASK(PWM5PHL), 2
#define PWM5PHL3                         BANKMASK(PWM5PHL), 3
#define PWM5PHL4                         BANKMASK(PWM5PHL), 4
#define PWM5PHL5                         BANKMASK(PWM5PHL), 5
#define PWM5PHL6                         BANKMASK(PWM5PHL), 6
#define PWM5PHL7                         BANKMASK(PWM5PHL), 7
#define PWM5POL                          BANKMASK(PWM5CON), 4
#define PWM5PRH0                         BANKMASK(PWM5PRH), 0
#define PWM5PRH1                         BANKMASK(PWM5PRH), 1
#define PWM5PRH2                         BANKMASK(PWM5PRH), 2
#define PWM5PRH3                         BANKMASK(PWM5PRH), 3
#define PWM5PRH4                         BANKMASK(PWM5PRH), 4
#define PWM5PRH5                         BANKMASK(PWM5PRH), 5
#define PWM5PRH6                         BANKMASK(PWM5PRH), 6
#define PWM5PRH7                         BANKMASK(PWM5PRH), 7
#define PWM5PRIE                         BANKMASK(PWM5INTE), 0
#define PWM5PRIF                         BANKMASK(PWM5INTF), 0
#define PWM5PRL0                         BANKMASK(PWM5PRL), 0
#define PWM5PRL1                         BANKMASK(PWM5PRL), 1
#define PWM5PRL2                         BANKMASK(PWM5PRL), 2
#define PWM5PRL3                         BANKMASK(PWM5PRL), 3
#define PWM5PRL4                         BANKMASK(PWM5PRL), 4
#define PWM5PRL5                         BANKMASK(PWM5PRL), 5
#define PWM5PRL6                         BANKMASK(PWM5PRL), 6
#define PWM5PRL7                         BANKMASK(PWM5PRL), 7
#define PWM5PS0                          BANKMASK(PWM5CLKCON), 4
#define PWM5PS1                          BANKMASK(PWM5CLKCON), 5
#define PWM5PS2                          BANKMASK(PWM5CLKCON), 6
#define PWM5TMRH0                        BANKMASK(PWM5TMRH), 0
#define PWM5TMRH1                        BANKMASK(PWM5TMRH), 1
#define PWM5TMRH2                        BANKMASK(PWM5TMRH), 2
#define PWM5TMRH3                        BANKMASK(PWM5TMRH), 3
#define PWM5TMRH4                        BANKMASK(PWM5TMRH), 4
#define PWM5TMRH5                        BANKMASK(PWM5TMRH), 5
#define PWM5TMRH6                        BANKMASK(PWM5TMRH), 6
#define PWM5TMRH7                        BANKMASK(PWM5TMRH), 7
#define PWM5TMRL0                        BANKMASK(PWM5TMRL), 0
#define PWM5TMRL1                        BANKMASK(PWM5TMRL), 1
#define PWM5TMRL2                        BANKMASK(PWM5TMRL), 2
#define PWM5TMRL3                        BANKMASK(PWM5TMRL), 3
#define PWM5TMRL4                        BANKMASK(PWM5TMRL), 4
#define PWM5TMRL5                        BANKMASK(PWM5TMRL), 5
#define PWM5TMRL6                        BANKMASK(PWM5TMRL), 6
#define PWM5TMRL7                        BANKMASK(PWM5TMRL), 7
#define PWMPW0                           BANKMASK(PWM3DCL), 6
#define PWMPW1                           BANKMASK(PWM3DCL), 7
#define PWMPW2                           BANKMASK(PWM3DCH), 0
#define PWMPW3                           BANKMASK(PWM3DCH), 1
#define PWMPW4                           BANKMASK(PWM3DCH), 2
#define PWMPW5                           BANKMASK(PWM3DCH), 3
#define PWMPW6                           BANKMASK(PWM3DCH), 4
#define PWMPW7                           BANKMASK(PWM3DCH), 5
#define PWMPW8                           BANKMASK(PWM3DCH), 6
#define PWMPW9                           BANKMASK(PWM3DCH), 7
#define R10                              BANKMASK(DAC1REFH), 2
#define R11                              BANKMASK(DAC1REFH), 3
#define R12                              BANKMASK(DAC1REFH), 4
#define R13                              BANKMASK(DAC1REFH), 5
#define R14                              BANKMASK(DAC1REFH), 6
#define R15                              BANKMASK(DAC1REFH), 7
#define R5                               BANKMASK(DAC1REFL), 5
#define R6                               BANKMASK(DAC1REFL), 6
#define R7                               BANKMASK(DAC1REFL), 7
#define R8                               BANKMASK(DAC1REFH), 0
#define R9                               BANKMASK(DAC1REFH), 1
#define RA0                              BANKMASK(PORTA), 0
#define RA1                              BANKMASK(PORTA), 1
#define RA2                              BANKMASK(PORTA), 2
#define RA3                              BANKMASK(PORTA), 3
#define RA4                              BANKMASK(PORTA), 4
#define RA5                              BANKMASK(PORTA), 5
#define RC0                              BANKMASK(PORTC), 0
#define RC1                              BANKMASK(PORTC), 1
#define RC2                              BANKMASK(PORTC), 2
#define RC3                              BANKMASK(PORTC), 3
#define RC4                              BANKMASK(PORTC), 4
#define RC5                              BANKMASK(PORTC), 5
#define RCEN                             BANKMASK(SSP1CON2), 3
#define RCIDL                            BANKMASK(BAUD1CON), 6
#define RCIE                             BANKMASK(PIE1), 5
#define RCIF                             BANKMASK(PIR1), 5
#define RD                               BANKMASK(PMCON1), 0
#define RDBS                             BANKMASK(COG1CON1), 7
#define RDY                              BANKMASK(PRG1CON1), 2
#define REDG                             BANKMASK(PRG1CON0), 4
#define REF10                            BANKMASK(DAC1REFH), 2
#define REF11                            BANKMASK(DAC1REFH), 3
#define REF12                            BANKMASK(DAC1REFH), 4
#define REF13                            BANKMASK(DAC1REFH), 5
#define REF14                            BANKMASK(DAC1REFH), 6
#define REF15                            BANKMASK(DAC1REFH), 7
#define REF6                             BANKMASK(DAC1REFL), 6
#define REF7                             BANKMASK(DAC1REFL), 7
#define REF8                             BANKMASK(DAC1REFH), 0
#define REF9                             BANKMASK(DAC1REFH), 1
#define RG1EN                            BANKMASK(PRG1CON0), 7
#define RG1FEDG                          BANKMASK(PRG1CON0), 5
#define RG1FPOL                          BANKMASK(PRG1CON1), 1
#define RG1FTSS0                         BANKMASK(PRG1FTSS), 0
#define RG1FTSS1                         BANKMASK(PRG1FTSS), 1
#define RG1FTSS2                         BANKMASK(PRG1FTSS), 2
#define RG1FTSS3                         BANKMASK(PRG1FTSS), 3
#define RG1GO                            BANKMASK(PRG1CON0), 0
#define RG1INS0                          BANKMASK(PRG1INS), 0
#define RG1INS1                          BANKMASK(PRG1INS), 1
#define RG1INS2                          BANKMASK(PRG1INS), 2
#define RG1INS3                          BANKMASK(PRG1INS), 3
#define RG1ISET0                         BANKMASK(PRG1CON2), 0
#define RG1ISET1                         BANKMASK(PRG1CON2), 1
#define RG1ISET2                         BANKMASK(PRG1CON2), 2
#define RG1ISET3                         BANKMASK(PRG1CON2), 3
#define RG1ISET4                         BANKMASK(PRG1CON2), 4
#define RG1MODE0                         BANKMASK(PRG1CON0), 2
#define RG1MODE1                         BANKMASK(PRG1CON0), 3
#define RG1OS                            BANKMASK(PRG1CON0), 1
#define RG1RDY                           BANKMASK(PRG1CON1), 2
#define RG1REDG                          BANKMASK(PRG1CON0), 4
#define RG1RPOL                          BANKMASK(PRG1CON1), 0
#define RG1RTSS0                         BANKMASK(PRG1RTSS), 0
#define RG1RTSS1                         BANKMASK(PRG1RTSS), 1
#define RG1RTSS2                         BANKMASK(PRG1RTSS), 2
#define RG1RTSS3                         BANKMASK(PRG1RTSS), 3
#define RIS0                             BANKMASK(COG1RIS0), 0
#define RIS1                             BANKMASK(COG1RIS0), 1
#define RIS10                            BANKMASK(COG1RIS1), 2
#define RIS11                            BANKMASK(COG1RIS1), 3
#define RIS12                            BANKMASK(COG1RIS1), 4
#define RIS13                            BANKMASK(COG1RIS1), 5
#define RIS14                            BANKMASK(COG1RIS1), 6
#define RIS2                             BANKMASK(COG1RIS0), 2
#define RIS3                             BANKMASK(COG1RIS0), 3
#define RIS4                             BANKMASK(COG1RIS0), 4
#define RIS5                             BANKMASK(COG1RIS0), 5
#define RIS6                             BANKMASK(COG1RIS0), 6
#define RIS7                             BANKMASK(COG1RIS0), 7
#define RIS8                             BANKMASK(COG1RIS1), 0
#define RIS9                             BANKMASK(COG1RIS1), 1
#define RPOL                             BANKMASK(PRG1CON1), 0
#define RSEN                             BANKMASK(SSP1CON2), 1
#define RSIM0                            BANKMASK(COG1RSIM0), 0
#define RSIM1                            BANKMASK(COG1RSIM0), 1
#define RSIM10                           BANKMASK(COG1RSIM1), 2
#define RSIM11                           BANKMASK(COG1RSIM1), 3
#define RSIM12                           BANKMASK(COG1RSIM1), 4
#define RSIM13                           BANKMASK(COG1RSIM1), 5
#define RSIM14                           BANKMASK(COG1RSIM1), 6
#define RSIM2                            BANKMASK(COG1RSIM0), 2
#define RSIM3                            BANKMASK(COG1RSIM0), 3
#define RSIM4                            BANKMASK(COG1RSIM0), 4
#define RSIM5                            BANKMASK(COG1RSIM0), 5
#define RSIM6                            BANKMASK(COG1RSIM0), 6
#define RSIM7                            BANKMASK(COG1RSIM0), 7
#define RSIM8                            BANKMASK(COG1RSIM1), 0
#define RSIM9                            BANKMASK(COG1RSIM1), 1
#define RTSS0                            BANKMASK(PRG1RTSS), 0
#define RTSS1                            BANKMASK(PRG1RTSS), 1
#define RTSS2                            BANKMASK(PRG1RTSS), 2
#define RTSS3                            BANKMASK(PRG1RTSS), 3
#define RX9                              BANKMASK(RC1STA), 6
#define RX9D                             BANKMASK(RC1STA), 0
#define R_nW                             BANKMASK(SSP1STAT), 2
#define SBCDE                            BANKMASK(SSP1CON3), 2
#define SBOREN                           BANKMASK(BORCON), 7
#define SCIE                             BANKMASK(SSP1CON3), 5
#define SCKP                             BANKMASK(BAUD1CON), 4
#define SCS0                             BANKMASK(OSCCON), 0
#define SCS1                             BANKMASK(OSCCON), 1
#define SDAHT                            BANKMASK(SSP1CON3), 3
#define SDATA                            BANKMASK(COG1STR), 4
#define SDATB                            BANKMASK(COG1STR), 5
#define SDATC                            BANKMASK(COG1STR), 6
#define SDATD                            BANKMASK(COG1STR), 7
#define SEN                              BANKMASK(SSP1CON2), 0
#define SENDB                            BANKMASK(TX1STA), 3
#define SLRA0                            BANKMASK(SLRCONA), 0
#define SLRA1                            BANKMASK(SLRCONA), 1
#define SLRA2                            BANKMASK(SLRCONA), 2
#define SLRA4                            BANKMASK(SLRCONA), 4
#define SLRA5                            BANKMASK(SLRCONA), 5
#define SLRC0                            BANKMASK(SLRCONC), 0
#define SLRC1                            BANKMASK(SLRCONC), 1
#define SLRC2                            BANKMASK(SLRCONC), 2
#define SLRC3                            BANKMASK(SLRCONC), 3
#define SLRC4                            BANKMASK(SLRCONC), 4
#define SLRC5                            BANKMASK(SLRCONC), 5
#define SMP                              BANKMASK(SSP1STAT), 7
#define SOSCEN                           BANKMASK(T1CON), 3
#define SOSCR                            BANKMASK(OSCSTAT), 7
#define SPEN                             BANKMASK(RC1STA), 7
#define SPLLEN                           BANKMASK(OSCCON), 7
#define SREN                             BANKMASK(RC1STA), 5
#define SSP1ADD0                         BANKMASK(SSP1ADD), 0
#define SSP1ADD1                         BANKMASK(SSP1ADD), 1
#define SSP1ADD2                         BANKMASK(SSP1ADD), 2
#define SSP1ADD3                         BANKMASK(SSP1ADD), 3
#define SSP1ADD4                         BANKMASK(SSP1ADD), 4
#define SSP1ADD5                         BANKMASK(SSP1ADD), 5
#define SSP1ADD6                         BANKMASK(SSP1ADD), 6
#define SSP1ADD7                         BANKMASK(SSP1ADD), 7
#define SSP1BUF0                         BANKMASK(SSP1BUF), 0
#define SSP1BUF1                         BANKMASK(SSP1BUF), 1
#define SSP1BUF2                         BANKMASK(SSP1BUF), 2
#define SSP1BUF3                         BANKMASK(SSP1BUF), 3
#define SSP1BUF4                         BANKMASK(SSP1BUF), 4
#define SSP1BUF5                         BANKMASK(SSP1BUF), 5
#define SSP1BUF6                         BANKMASK(SSP1BUF), 6
#define SSP1BUF7                         BANKMASK(SSP1BUF), 7
#define SSP1IE                           BANKMASK(PIE1), 3
#define SSP1IF                           BANKMASK(PIR1), 3
#define SSP1MSK0                         BANKMASK(SSP1MSK), 0
#define SSP1MSK1                         BANKMASK(SSP1MSK), 1
#define SSP1MSK2                         BANKMASK(SSP1MSK), 2
#define SSP1MSK3                         BANKMASK(SSP1MSK), 3
#define SSP1MSK4                         BANKMASK(SSP1MSK), 4
#define SSP1MSK5                         BANKMASK(SSP1MSK), 5
#define SSP1MSK6                         BANKMASK(SSP1MSK), 6
#define SSP1MSK7                         BANKMASK(SSP1MSK), 7
#define SSPEN                            BANKMASK(SSP1CON1), 5
#define SSPM0                            BANKMASK(SSP1CON1), 0
#define SSPM1                            BANKMASK(SSP1CON1), 1
#define SSPM2                            BANKMASK(SSP1CON1), 2
#define SSPM3                            BANKMASK(SSP1CON1), 3
#define SSPOV                            BANKMASK(SSP1CON1), 6
#define STKOVF                           BANKMASK(PCON), 7
#define STKUNF                           BANKMASK(PCON), 6
#define STRA                             BANKMASK(COG1STR), 0
#define STRB                             BANKMASK(COG1STR), 1
#define STRC                             BANKMASK(COG1STR), 2
#define STRD                             BANKMASK(COG1STR), 3
#define SWDTEN                           BANKMASK(WDTCON), 0
#define T0CS                             BANKMASK(OPTION_REG), 5
#define T0IE                             BANKMASK(INTCON), 5
#define T0IF                             BANKMASK(INTCON), 2
#define T0SE                             BANKMASK(OPTION_REG), 4
#define T1CKPS0                          BANKMASK(T1CON), 4
#define T1CKPS1                          BANKMASK(T1CON), 5
#define T1CS0                            BANKMASK(T1CON), 6
#define T1CS1                            BANKMASK(T1CON), 7
#define T1GE                             BANKMASK(T1GCON), 7
#define T1GGO_nDONE                      BANKMASK(T1GCON), 3
#define T1GPOL                           BANKMASK(T1GCON), 6
#define T1GSPM                           BANKMASK(T1GCON), 4
#define T1GSS0                           BANKMASK(T1GCON), 0
#define T1GSS1                           BANKMASK(T1GCON), 1
#define T1GTM                            BANKMASK(T1GCON), 5
#define T1GVAL                           BANKMASK(T1GCON), 2
#define T1ON                             BANKMASK(T1CON), 0
