GopalSaraf/Practicals/PSDL/include/proc/pic16lf1765.inc
#define T1OSCEN                          BANKMASK(T1CON), 3
#define T2CKPOL                          BANKMASK(T2HLT), 6
#define T2CKPS0                          BANKMASK(T2CON), 4
#define T2CKPS1                          BANKMASK(T2CON), 5
#define T2CKPS2                          BANKMASK(T2CON), 6
#define T2CKSYNC                         BANKMASK(T2HLT), 5
#define T2CS0                            BANKMASK(T2CLKCON), 0
#define T2CS1                            BANKMASK(T2CLKCON), 1
#define T2CS2                            BANKMASK(T2CLKCON), 2
#define T2CS3                            BANKMASK(T2CLKCON), 3
#define T2MODE0                          BANKMASK(T2HLT), 0
#define T2MODE1                          BANKMASK(T2HLT), 1
#define T2MODE2                          BANKMASK(T2HLT), 2
#define T2MODE3                          BANKMASK(T2HLT), 3
#define T2MODE4                          BANKMASK(T2HLT), 4
#define T2ON                             BANKMASK(T2CON), 7
#define T2OUTPS0                         BANKMASK(T2CON), 0
#define T2OUTPS1                         BANKMASK(T2CON), 1
#define T2OUTPS2                         BANKMASK(T2CON), 2
#define T2OUTPS3                         BANKMASK(T2CON), 3
#define T2PSYNC                          BANKMASK(T2HLT), 7
#define T2RSEL0                          BANKMASK(T2RST), 0
#define T2RSEL1                          BANKMASK(T2RST), 1
#define T2RSEL2                          BANKMASK(T2RST), 2
#define T2RSEL3                          BANKMASK(T2RST), 3
#define T3CKPS0                          BANKMASK(T3CON), 4
#define T3CKPS1                          BANKMASK(T3CON), 5
#define T3CS0                            BANKMASK(T3CON), 6
#define T3CS1                            BANKMASK(T3CON), 7
#define T3GE                             BANKMASK(T3GCON), 7
#define T3GGO_nDONE                      BANKMASK(T3GCON), 3
#define T3GPOL                           BANKMASK(T3GCON), 6
#define T3GSPM                           BANKMASK(T3GCON), 4
#define T3GSS0                           BANKMASK(T3GCON), 0
#define T3GSS1                           BANKMASK(T3GCON), 1
#define T3GTM                            BANKMASK(T3GCON), 5
#define T3GVAL                           BANKMASK(T3GCON), 2
#define T3ON                             BANKMASK(T3CON), 0
#define T4CKPOL                          BANKMASK(T4HLT), 6
#define T4CKPS0                          BANKMASK(T4CON), 4
#define T4CKPS1                          BANKMASK(T4CON), 5
#define T4CKPS2                          BANKMASK(T4CON), 6
#define T4CKSYNC                         BANKMASK(T4HLT), 5
#define T4CS0                            BANKMASK(T4CLKCON), 0
#define T4CS1                            BANKMASK(T4CLKCON), 1
#define T4CS2                            BANKMASK(T4CLKCON), 2
#define T4CS3                            BANKMASK(T4CLKCON), 3
#define T4MODE0                          BANKMASK(T4HLT), 0
#define T4MODE1                          BANKMASK(T4HLT), 1
#define T4MODE2                          BANKMASK(T4HLT), 2
#define T4MODE3                          BANKMASK(T4HLT), 3
#define T4MODE4                          BANKMASK(T4HLT), 4
#define T4ON                             BANKMASK(T4CON), 7
#define T4OUTPS0                         BANKMASK(T4CON), 0
#define T4OUTPS1                         BANKMASK(T4CON), 1
#define T4OUTPS2                         BANKMASK(T4CON), 2
#define T4OUTPS3                         BANKMASK(T4CON), 3
#define T4PSYNC                          BANKMASK(T4HLT), 7
#define T4RSEL0                          BANKMASK(T4RST), 0
#define T4RSEL1                          BANKMASK(T4RST), 1
#define T4RSEL2                          BANKMASK(T4RST), 2
#define T4RSEL3                          BANKMASK(T4RST), 3
#define T5CKPS0                          BANKMASK(T5CON), 4
#define T5CKPS1                          BANKMASK(T5CON), 5
#define T5CS0                            BANKMASK(T5CON), 6
#define T5CS1                            BANKMASK(T5CON), 7
#define T5GE                             BANKMASK(T5GCON), 7
#define T5GGO_nDONE                      BANKMASK(T5GCON), 3
#define T5GPOL                           BANKMASK(T5GCON), 6
#define T5GSPM                           BANKMASK(T5GCON), 4
#define T5GSS0                           BANKMASK(T5GCON), 0
#define T5GSS1                           BANKMASK(T5GCON), 1
#define T5GTM                            BANKMASK(T5GCON), 5
#define T5GVAL                           BANKMASK(T5GCON), 2
#define T5ON                             BANKMASK(T5CON), 0
#define T6CKPOL                          BANKMASK(T6HLT), 6
#define T6CKPS0                          BANKMASK(T6CON), 4
#define T6CKPS1                          BANKMASK(T6CON), 5
#define T6CKPS2                          BANKMASK(T6CON), 6
#define T6CKSYNC                         BANKMASK(T6HLT), 5
#define T6CS0                            BANKMASK(T6CLKCON), 0
#define T6CS1                            BANKMASK(T6CLKCON), 1
#define T6CS2                            BANKMASK(T6CLKCON), 2
#define T6CS3                            BANKMASK(T6CLKCON), 3
#define T6MODE0                          BANKMASK(T6HLT), 0
#define T6MODE1                          BANKMASK(T6HLT), 1
#define T6MODE2                          BANKMASK(T6HLT), 2
#define T6MODE3                          BANKMASK(T6HLT), 3
#define T6MODE4                          BANKMASK(T6HLT), 4
#define T6ON                             BANKMASK(T6CON), 7
#define T6OUTPS0                         BANKMASK(T6CON), 0
#define T6OUTPS1                         BANKMASK(T6CON), 1
#define T6OUTPS2                         BANKMASK(T6CON), 2
#define T6OUTPS3                         BANKMASK(T6CON), 3
#define T6PSYNC                          BANKMASK(T6HLT), 7
#define T6RSEL0                          BANKMASK(T6RST), 0
#define T6RSEL1                          BANKMASK(T6RST), 1
#define T6RSEL2                          BANKMASK(T6RST), 2
#define T6RSEL3                          BANKMASK(T6RST), 3
#define TMR0CS                           BANKMASK(OPTION_REG), 5
#define TMR0IE                           BANKMASK(INTCON), 5
#define TMR0IF                           BANKMASK(INTCON), 2
#define TMR0SE                           BANKMASK(OPTION_REG), 4
#define TMR1CS0                          BANKMASK(T1CON), 6
#define TMR1CS1                          BANKMASK(T1CON), 7
#define TMR1GE                           BANKMASK(T1GCON), 7
#define TMR1GIE                          BANKMASK(PIE1), 7
#define TMR1GIF                          BANKMASK(PIR1), 7
#define TMR1IE                           BANKMASK(PIE1), 0
#define TMR1IF                           BANKMASK(PIR1), 0
#define TMR1ON                           BANKMASK(T1CON), 0
#define TMR2IE                           BANKMASK(PIE1), 1
#define TMR2IF                           BANKMASK(PIR1), 1
#define TMR2ON                           BANKMASK(T2CON), 7
#define TMR3CS0                          BANKMASK(T3CON), 6
#define TMR3CS1                          BANKMASK(T3CON), 7
#define TMR3GE                           BANKMASK(T3GCON), 7
#define TMR3GIE                          BANKMASK(PIE4), 3
#define TMR3GIF                          BANKMASK(PIR4), 3
#define TMR3IE                           BANKMASK(PIE4), 2
#define TMR3IF                           BANKMASK(PIR4), 2
#define TMR3ON                           BANKMASK(T3CON), 0
#define TMR4IE                           BANKMASK(PIE4), 0
#define TMR4IF                           BANKMASK(PIR4), 0
#define TMR4ON                           BANKMASK(T4CON), 7
#define TMR5CS0                          BANKMASK(T5CON), 6
#define TMR5CS1                          BANKMASK(T5CON), 7
#define TMR5GE                           BANKMASK(T5GCON), 7
#define TMR5GIE                          BANKMASK(PIE4), 5
#define TMR5GIF                          BANKMASK(PIR4), 5
#define TMR5IE                           BANKMASK(PIE4), 4
#define TMR5IF                           BANKMASK(PIR4), 4
#define TMR5ON                           BANKMASK(T5CON), 0
#define TMR6IE                           BANKMASK(PIE4), 1
#define TMR6IF                           BANKMASK(PIR4), 1
#define TMR6ON                           BANKMASK(T6CON), 7
#define TRIGSEL0                         BANKMASK(ADCON2), 3
#define TRIGSEL1                         BANKMASK(ADCON2), 4
#define TRIGSEL2                         BANKMASK(ADCON2), 5
#define TRIGSEL3                         BANKMASK(ADCON2), 6
#define TRIGSEL4                         BANKMASK(ADCON2), 7
#define TRISA0                           BANKMASK(TRISA), 0
#define TRISA1                           BANKMASK(TRISA), 1
#define TRISA2                           BANKMASK(TRISA), 2
#define TRISA4                           BANKMASK(TRISA), 4
#define TRISA5                           BANKMASK(TRISA), 5
#define TRISC0                           BANKMASK(TRISC), 0
#define TRISC1                           BANKMASK(TRISC), 1
#define TRISC2                           BANKMASK(TRISC), 2
#define TRISC3                           BANKMASK(TRISC), 3
#define TRISC4                           BANKMASK(TRISC), 4
#define TRISC5                           BANKMASK(TRISC), 5
#define TRMT                             BANKMASK(TX1STA), 1
#define TSEN                             BANKMASK(FVRCON), 5
#define TSRNG                            BANKMASK(FVRCON), 4
#define TUN0                             BANKMASK(OSCTUNE), 0
#define TUN1                             BANKMASK(OSCTUNE), 1
#define TUN2                             BANKMASK(OSCTUNE), 2
#define TUN3                             BANKMASK(OSCTUNE), 3
#define TUN4                             BANKMASK(OSCTUNE), 4
#define TUN5                             BANKMASK(OSCTUNE), 5
#define TX9                              BANKMASK(TX1STA), 6
#define TX9D                             BANKMASK(TX1STA), 0
#define TXEN                             BANKMASK(TX1STA), 5
#define TXIE                             BANKMASK(PIE1), 4
#define TXIF                             BANKMASK(PIR1), 4
#define UA                               BANKMASK(SSP1STAT), 1
#define UG                               BANKMASK(OPA1CON), 4
#define WCOL                             BANKMASK(SSP1CON1), 7
#define WDTPS0                           BANKMASK(WDTCON), 1
#define WDTPS1                           BANKMASK(WDTCON), 2
#define WDTPS2                           BANKMASK(WDTCON), 3
#define WDTPS3                           BANKMASK(WDTCON), 4
#define WDTPS4                           BANKMASK(WDTCON), 5
#define WPUA0                            BANKMASK(WPUA), 0
#define WPUA1                            BANKMASK(WPUA), 1
#define WPUA2                            BANKMASK(WPUA), 2
#define WPUA3                            BANKMASK(WPUA), 3
#define WPUA4                            BANKMASK(WPUA), 4
#define WPUA5                            BANKMASK(WPUA), 5
#define WPUC0                            BANKMASK(WPUC), 0
#define WPUC1                            BANKMASK(WPUC), 1
#define WPUC2                            BANKMASK(WPUC), 2
#define WPUC3                            BANKMASK(WPUC), 3
#define WPUC4                            BANKMASK(WPUC), 4
#define WPUC5                            BANKMASK(WPUC), 5
#define WR                               BANKMASK(PMCON1), 1
#define WREN                             BANKMASK(PMCON1), 2
#define WRERR                            BANKMASK(PMCON1), 3
#define WUE                              BANKMASK(BAUD1CON), 1
#define ZCD1EN                           BANKMASK(ZCD1CON), 7
#define ZCD1INTN                         BANKMASK(ZCD1CON), 0
#define ZCD1INTP                         BANKMASK(ZCD1CON), 1
#define ZCD1OUT                          BANKMASK(ZCD1CON), 5
#define ZCD1POL                          BANKMASK(ZCD1CON), 4
#define ZCDIE                            BANKMASK(PIE3), 4
#define ZCDIF                            BANKMASK(PIR3), 4
#define ZERO                             BANKMASK(STATUS), 2
#define Z_SHAD                           BANKMASK(STATUS_SHAD), 2
#define nBOR                             BANKMASK(PCON), 0
#define nPD                              BANKMASK(STATUS), 3
#define nPOR                             BANKMASK(PCON), 1
#define nRI                              BANKMASK(PCON), 2
#define nRMCLR                           BANKMASK(PCON), 3
#define nRWDT                            BANKMASK(PCON), 4
#define nT1SYNC                          BANKMASK(T1CON), 2
#define nT3SYNC                          BANKMASK(T3CON), 2
#define nT5SYNC                          BANKMASK(T5CON), 2
#define nTO                              BANKMASK(STATUS), 4
#define nWPUEN                           BANKMASK(OPTION_REG), 7

/*
 * Device Psects
 */

#ifdef _XC_INC_

// Memory Spaces
#define SPACE_CODE   0
#define SPACE_DATA   1
#define SPACE_EEPROM 3

psect udata_shr,class=COMMON,space=SPACE_DATA,noexec
psect udata,class=RAM,space=SPACE_DATA,noexec
psect udata_bank0,class=BANK0,space=SPACE_DATA,noexec
psect udata_bank1,class=BANK1,space=SPACE_DATA,noexec
psect udata_bank2,class=BANK2,space=SPACE_DATA,noexec
psect udata_bank3,class=BANK3,space=SPACE_DATA,noexec
psect udata_bank4,class=BANK4,space=SPACE_DATA,noexec
psect udata_bank5,class=BANK5,space=SPACE_DATA,noexec
psect udata_bank6,class=BANK6,space=SPACE_DATA,noexec
psect udata_bank7,class=BANK7,space=SPACE_DATA,noexec
psect udata_bank8,class=BANK8,space=SPACE_DATA,noexec
psect udata_bank9,class=BANK9,space=SPACE_DATA,noexec
psect udata_bank10,class=BANK10,space=SPACE_DATA,noexec
psect udata_bank11,class=BANK11,space=SPACE_DATA,noexec
psect udata_bank12,class=BANK12,space=SPACE_DATA,noexec
psect code,class=CODE,space=SPACE_CODE,delta=2
psect data,class=STRCODE,space=SPACE_CODE,delta=2,noexec

#endif // _XC_INC_

#endif // _PIC16LF1765_INC_
